app/views/listings/your_listings.html.erb

	<p><a href="/listings/<%= x.id %>/reservations">View Listing Reservations</a></p>
	<p>Number of reservations: <%= Reservation.where(listing_id: x.id).count %></p>
---
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."listing_id" = $1  [["listing_id", 41]]