app/views/reservations/your_reservations.html.erb

<ul>Booking <%=index+1%></ul>
	<li>Location: <%=Listing.find(x.listing_id).name%></li>
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]