app/controllers/listings_controller.rb

	def create
		@new = current_user.listings.new(listing_params)
		if @new.save
---
INSERT INTO "listings" ("location", "tags", "user_id", "created_at", "updated_at", "name", "place_type", "property_type", "room_number", "bed_number", "guest_number", "country", "state", "city", "zipcode", "price", "description", "image", "listing_cover") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"

	def index
		@listing_count = Listing.where(verified: true).count
		@listings = Listing.page(params[:page]).per(10).where(verified: true)
---
SELECT COUNT(*) FROM "listings" WHERE "listings"."verified" = $1  [["verified", true]]
SELECT  "listings".* FROM "listings" WHERE "listings"."verified" = $1 LIMIT $2 OFFSET $3  [["verified", true], ["LIMIT", 10], ["OFFSET", 0]]

	def show
		@listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]

	def edit
		@listing = Listing.find(params[:id])
		@user = User.find(params[:user_id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]

	def update
		@listing = Listing.find(params[:id])
		if @listing.update(listing_params)
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
UPDATE "listings" SET "place_type" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["place_type", 0], ["updated_at", "2018-06-24 09:50:17.928337"], ["id", 41]]

	def destroy
		@listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]

	def verify
		@listing = Listing.find(params[:id])
		@listing.update(verified: true)
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
UPDATE "listings" SET "verified" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["verified", true], ["updated_at", "2018-06-24 09:57:40.704277"], ["id", 41]]

	def unverified
		@listing_count = Listing.where(verified: false).count
		@listings = Listing.page(params[:page]).per(10).where(verified: false)
---
SELECT COUNT(*) FROM "listings" WHERE "listings"."verified" = $1  [["verified", false]]
SELECT  "listings".* FROM "listings" WHERE "listings"."verified" = $1 LIMIT $2 OFFSET $3  [["verified", false], ["LIMIT", 10], ["OFFSET", 0]]

	def your_listings
		@listings = Listing.where(user_id: current_user.id)
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = $1  [["user_id", 21]]

	def require_superadmin
		unless current_user == Listing.find(params[:id]).user || current_user.superadmin?
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]