app/controllers/reservations_controller.rb

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."listing_id" = $1  [["listing_id", 41]]
---
	def new
		@listing = Listing.find(params[:listing_id])
		@dates = []
		@reservations = @listing.reservations
		@reservations.each do |r|

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "listing_id", "start_date", "end_date", "guest_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@listing = Listing.find(params[:listing_id])
		@host = User.find(@listing.user_id)
		@reservation = current_user.reservations.new(reservation_params)
		@reservation.listing_id = params[:listing_id]

		if @reservation.save

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1  [["user_id", 21]]
---
	def your_reservations
		@reservations = Reservation.where(user_id: current_user.id)