app/controllers/users_controller.rb

	def create
		@user = User.new(users_params)
		@user.gender = params[:user][:gender] == "male" ? 0 : 1
		@user.password = params[:user][:password]
		if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at", "encrypted_password", "remember_token", "gender", "phone", "country", "birthdate", "avatar") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"