app/controllers/welcome_controller.rb

SELECT "listings".* FROM "listings" WHERE "listings"."verified" = $1  [["verified", true]]
---
	def index
		@listings = Listing.where(verified: true).sample(6)