app/models/reservation.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."listing_id" = $1  [["listing_id", 41]]
---
    def check_overlapping_dates
    	dates = []
    	listing.reservations.each do |x|